topic_101/find_files/find_1.org
#+title: Find files and commands at Linux
#+author: gabriel
#+description: 104.7


* type and file
O comando type mostra se cada nome de comando é um comando do UNIX, um comando interno, um alias, uma palavra-chave do shell ou uma função de shell definida

Para saber se o comando alias é um comando interno, comando UNIX ->
#+begin_src sh
type alias

[root@centos6-lpic1 ~]# type alias
alias is a shell builtin
#+end_src

Outro comando que a LPI costuma cobrar no exame 101 é o comando ~file~ que determina o tipo do arquivo analisando o seu conteúdo. O exemplo abaixo mostra um pouco seu uso ->

#+begin_src sh
file /bin/cat
file /dev/sda1
file /etc/passwd
file /usr/sbin/adduser
#+end_src


* whereis and which

O comando ~whereis~ é utilizado para mostrar a localização do binário do comando, do arquivo de configuração(caso exista), e a localização das páginas de manuais de determinado comando ou arquivo.

Mostrar a localização do binário do comando, docs, etc do vim ->
#+begin_src sh
whereis vim
#+end_src

O comando ~which~ é bem semelhante ao comando ~whereis~, entretanto este só mostra a localização do binário do comando, buscando variável PATH
#+begin_src sh
which vim
#+end_src
